dairui/traffic_yellow_flash_board/CAN_Driver/CAN_STM32F103.c
/*----------------------------------------------------------------------------
 *      RL-ARM - CAN
 *----------------------------------------------------------------------------
 *      Name:    CAN_STM32F103.c
 *      Purpose: CAN Driver, Hardware specific module for ST STM32F103
 *      Rev.:    V4.70
 *----------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *---------------------------------------------------------------------------*/

#include <RTL.h>                      /* RTX kernel functions & defines      */
#include <RTX_CAN.h>                  /* CAN Generic functions & defines     */
#include <STM32F10x.h>                /* STM32F10x Definitions               */


#define __CTRL1                 1
#define __CTRL2                 2

#define __FILTER_BANK_MAX      13     /* filter banks 0..13 */


/************************* CAN Hardware Configuration ************************/

// *** <<< Use Configuration Wizard in Context Menu >>> ***

// <o> CAN Peripheral Clock (in Hz) <1-1000000000>
//     <i> Same as PCLK1
#define CAN_CLK               36000000

// *** <<< End of Configuration section             >>> ***


/*----------------------------------------------------------------------------
 *      CAN RTX Hardware Specific Driver Functions
 *----------------------------------------------------------------------------
 *  Functions implemented in this module:
 *    static      void CAN_set_timing      (U32 ctrl, U32 tseg1, U32 tseg2, U32 sjw, U32 brp)
 *    static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)
 *           CAN_ERROR CAN_hw_setup        (U32 ctrl)
 *           CAN_ERROR CAN_hw_init         (U32 ctrl, U32 baudrate)
 *           CAN_ERROR CAN_hw_start        (U32 ctrl)
 *           CAN_ERROR CAN_hw_testmode     (U32 ctrl, U32 testmode)
 *           CAN_ERROR CAN_hw_tx_empty     (U32 ctrl)
 *           CAN_ERROR CAN_hw_wr           (U32 ctrl,         CAN_msg *msg)
 *    static      void CAN_hw_rd           (U32 ctrl, U32 ch, CAN_msg *msg)
 *           CAN_ERROR CAN_hw_set          (U32 ctrl,         CAN_msg *msg)
 *           CAN_ERROR CAN_hw_rx_object    (U32 ctrl, U32 ch, U32 id, U32 object_para)
 *           CAN_ERROR CAN_hw_tx_object    (U32 ctrl, U32 ch,         U32 object_para)
 *    Interrupt fuction
 *---------------------------------------------------------------------------*/

/* Static functions used only in this module                                 */
static void CAN_hw_rd            (U32 ctrl, U32 ch, CAN_msg *msg);
static BOOL CAN_hw_rx_object_chk (U32 ctrl, U16 bank,         U32 object_para);
static void CAN_hw_rx_object_add (U32 ctrl, U16 bank, U32 id, U32 object_para);

/* CAN Controller Register Addresses                                         */
CAN_TypeDef *CAN_CTRL[] = { CAN1 };

/* Static variables used only in this module                                 */
static U16 CAN1_filterIdx = 0;
static U16 CAN2_filterIdx = 0;

/************************* Auxiliary Functions *******************************/

/*--------------------------- CAN_set_timing --------------------------------
 *
 *  Setup the CAN timing with specific parameters
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              tseg1:      Specifies Time Segment before the sample point
 *              tseg2:      Time Segment after the sample point
 *              sjw:        Synchronisation Jump Width
 *              brp:        Baud Rate Prescaler
 *
 *---------------------------------------------------------------------------*/

static void CAN_set_timing (U32 ctrl, U32 tseg1, U32 tseg2, U32 sjw, U32 brp) {
  CAN_TypeDef *CANx = CAN_CTRL[ctrl-1];

  CANx->BTR &= ~(((          0x03) << 24) | ((            0x07) << 20) | ((            0x0F) << 16) | (          0x3FF));
  CANx->BTR |=  ((((sjw-1) & 0x03) << 24) | (((tseg2-1) & 0x07) << 20) | (((tseg1-1) & 0x0F) << 16) | ((brp-1) & 0x3FF));
}


/*--------------------------- CAN_set_baudrate ------------------------------
 *
 *  Setup the requested baudrate
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              baudrate:   Baudrate
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)  {
  U32 brp;

  /* Note: this calculations fit for PCLK1 = 36MHz */
  /* Determine which nominal time to use for requested baudrate and set
     appropriate bit timing                                                  */
  if (baudrate <= 500000)  {
    brp  = (CAN_CLK / 18) / baudrate;

    /* Load the baudrate registers BTR                                       */
    /* so that sample point is at about 72% bit time from bit start          */
    /* TSEG1 = 12, TSEG2 = 5, SJW = 4 => 1 CAN bit = 18 TQ, sample at 72%    */
    CAN_set_timing(ctrl, 12, 5, 4, brp);
  }  else if (baudrate <= 1000000)  {
    brp  = (CAN_CLK / 9) / baudrate;

    /* Load the baudrate registers BTR                                       */
    /* so that sample point is at about 72% bit time from bit start          */
    /* TSEG1 = 5, TSEG2 = 3, SJW = 3 => 1 CAN bit = 9 TQ, sample at 66%      */
    CAN_set_timing(ctrl,  5, 3, 3, brp);
  }  else  {
    return CAN_BAUDRATE_ERROR;
  }

  return CAN_OK;
}


/*************************** Module Functions ********************************/

/*--------------------------- CAN_hw_setup ----------------------------------
 *
 *  Setup CAN transmit and receive PINs and interrupt vectors
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_setup (U32 ctrl)  {

  /* 1. Enable CAN controller Clock                                          */
  RCC->APB1ENR |= (1 << 25);

// // //   /* Note: MCBSTM32 uses PB8 and PB9 for CAN */
// // //   /* 2. Setup CAN Tx and Rx pins                                             */
// // //   RCC->APB2ENR |= (1 << 0);                         // enable clock for Alternate Function
// // //   AFIO->MAPR   &= 0xFFFF9FFF;                       // reset CAN remap
// // //   AFIO->MAPR   |= 0x00004000;                       //   set CAN remap, use PB8, PB9
// // //   /* GPIOB clock enable */
// // //   RCC->APB2ENR |= (1 << 3);
// // //   /* Configure CAN pin: RX PB.8 input push pull */
// // //   GPIOB->CRH &= ~(0x0F<<0);
// // //   GPIOB->CRH |=  (0x08<<0);
// // //   
// // //   /* Configure CAN pin: TX PB.9 alternate output push pull */
// // //   GPIOB->CRH &= ~(0x0F<<4);
// // //   GPIOB->CRH |=  (0x0B<<4);
// // // 	
	
//=======================================	
//=======================================	
//=======================================	
  /* Note: MCBSTM32 uses PB8 and PB9 for CAN */
  /* 2. Setup CAN Tx and Rx pins                                             */
  RCC->APB2ENR |= (1 << 0);                         // enable clock for Alternate Function
  AFIO->MAPR   &= 0xFFFF9FFF;                       // reset CAN remap
	AFIO->MAPR   |= 0x00000000;                       //   set CAN remap, use PA11, PA12
  /* GPIOA clock enable */
  RCC->APB2ENR |= (1 << 2);  
  /* Configure CAN pin: RX PA.11 input push pull */ 
  GPIOA->CRH &= ~(0x0F<<12);
  GPIOA->CRH |=  (0x08<<12);
  
  /* Configure CAN pin: TX PA.12 alternate output push pull */
  GPIOA->CRH &= ~(0x0F<<16);
  GPIOA->CRH |=  (0x0B<<16);
	


